import pandas as pd

data = {
    "Товар": ["Клавиатура", "Мышь", "Тетрадь", "Ручка", "Наушники"],
    "Категория": ["техника", "техника", "канцелярия", "канцелярия", "техника"],
    "Цена": [2500, 1200, 80, 40, 3200],
    "Количество": [12, 20, 100, 150, 8]
}


df = pd.DataFrame(data)


print(df)
print(df[df["Категория"] == "техника"])
print(df[df["Цена"] < 1000])
print(df[(df["Категория"] == "техника") & (df["Цена"] > 2000)])
print(df.loc[df["Количество"] < 50, ["Товар", "Цена"]])
print(df.loc[(df["Товар"] == "Ручка") | (df["Цена"] < 1000) | (df["Цена"] > 2500), ["Товар", "Количество"]])
