import pandas as pd

data = {
    "Товар": [
        "Клавиатура", "Мышь", "Тетрадь", "Ручка", "Наушники",
        "Клавиатура", "Мышь", "Тетрадь", "Ручка", "Наушники"
    ],
    "Категория": [
        "техника", "техника", "канцелярия", "канцелярия", "техника",
        "техника", "техника", "канцелярия", "канцелярия", "техника"
    ],
    "Цена": [2500, 1200, 80, 40, 3200, 2700, 1100, 90, 50, 3000],
    "Количество": [12, 20, 100, 150, 8, 10, 15, 120, 130, 6]
}


df = pd.DataFrame(data)


print(df)
print(df.groupby("Категория")["Цена"].agg(["mean", "min", "max"]))
print(df.groupby("Категория")["Количество"].sum())
print(df.groupby(["Категория", "Товар"])["Количество"].sum())
